#include <iostream>
using namespace std;
int main() {
	//дано целое полож. число н. вывести н раз символ @;
	/*int  n;
	cin >> n;
	for (int i = 1; i <= n; i += 1) {
		cout << '@';
	}*/
	//#2
	//int i, a, b;
	//cin >> a >> b;
	//i = b;
	//while (i >= a) {
	//	cout << i << "  ";
	//	i--;
	//}
	//for3/
	/*int a, b,  sum = 0;
	cin >> a >> b;
	for ( int  i = a; i <= b; i++) {
		if (i % 2 == 0) {
			sum += i;
		}
	}
	cout << sum<< endl;*/
	//while4
	//10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
	//int i = 1;
	//int sum = 0;
	//while (i <= 50) {
	//	if (i % 5 == 0 || i % 7 == 0) {
	//		sum += i;
	//	}
	//	i++;
	//}
	//cout << sum << " ";
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	//int i;
	//for (i = 10; i <= 99; i++) {
	//	if (i % 4 == 0 && i % 6 != 0) {
	//		cout << i << " ";
	//	}
	//}
	//12. Найти произведение двузначных нечетных чисел кратных 13.
	/*int i = 10;
	int p = 1;
	while (i <= 99) {
		if (i % 2 == 0 && i % 13 == 0) {
			p *= i;
		}
		i++;
	}
	cout << p << " ";*/
	//13. Найти сумму чисел от 100 до 200 кратных 17.
	/*int sum = 0 , i;
	for (i = 100; i <= 200; i++) {
		if (i % 17 == 0) {
			sum += i;
		}
	}
	cout << sum;*/
	//14. Составьте программу, которая вычисляет сумму квадратов чисел от 1 до введенного вами целого числа N.
	/*int n, i = 1;
	cin >> n;
	int sum = 0;
	while (i <= n) {
		sum += i * i;
		i++;
	}
	cout << sum;*/
	//15. Написать программу, которая по заданным значениям чисел a и b находит a в степени b. В запросе укажите допустимые значения этих переменных( Например если а - дробное, то b не может быть отрицательным).

}